       01  TEST5.
          10 DECIMAL-NORMAL PICTURE 9(19),99.
          10 DECIMAL-NEGATIVE PIC -9(19),99.
          10 DECIMAL-PRECISION   PIC     9,999999.
          10 DECIMAL-NEGATIVE-PRECISION PICTURE IS -99,9(6).
          10 DECIMAL-ZERO PICTURE IS -99,9(7).